---
kind: type
id: T:Autodesk.Revit.DB.ExtensibleStorage.Field
source: html/0aeabd09-5c61-0439-e4c7-e1d68d0e1a3b.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field

The description of a field within a Schema in the Extensible Storage framework. Contains
 the field's name, type, access control and documentation.

## Syntax (C#)
```csharp
public class Field : IDisposable
```